salesforce-minor-mode.org
:PROPERTIES:
:header-args: :shebang ";; -*- no-byte-compile: t; no-native-compile: t; lexical-binding: t -*-"
:END:

#+title:     DX-MINOR-MODE
#+author:    tan.nguyen
#+email:     tan.nguyen@furucrm.com

* TABLE OF CONTENTS :toc_5:
- [[#configuration-dx][CONFIGURATION DX]]
- [[#dx-core][DX CORE]]
  - [[#generate-command][Generate command]]
  - [[#execute-apex-code][Execute apex code]]
    - [[#execute-soql-block][Execute soql block]]
  - [[#convert-hashtable-to-list-data][Convert hashtable to list data]]
  - [[#custom-map-list-function][Custom map list function]]
  - [[#extract-data-in-json][Extract data in JSON]]
  - [[#find-root-dir][Find root dir]]
  - [[#build-path-to-file][Build path to file]]
  - [[#list-salesforce-org][List salesforce org]]
  - [[#filter-log-contents][Filter log contents]]
  - [[#authentication-org][Authentication org]]
  - [[#handle-dx-process-json][Handle DX process JSON]]
  - [[#get-current-org][Get current org]]
  - [[#cache-directory][Cache directory]]
  - [[#log-directory][Log directory]]
  - [[#find-backup-file][Find backup file]]
  - [[#check-org-status][Check org status]]
  - [[#get-lwc-directory][Get lwc directory]]
  - [[#find-parents][Find parents]]
  - [[#package-name][Package name]]
- [[#dx-process][DX PROCESS]]
  - [[#process-event-log][Process event log]]
  - [[#parse-json][Parse json]]
  - [[#make-process][Make Process]]
  - [[#make-chain-process][Make chain process]]
  - [[#handler-json-output][Handler Json output]]
  - [[#clear-process-buffers][Clear process buffers]]
  - [[#provide-name][Provide Name]]
- [[#dx-features][DX FEATURES]]
  - [[#org-features][Org features]]
    - [[#open-org-within-ctable][Open org within ctable]]
    - [[#open-org-project][Open org project]]
    - [[#view-all-connected-org][View all connected org]]
      - [[#view-all-orgs][view all orgs]]
      - [[#view-all-devhubs-orgs][view all devhubs orgs]]
    - [[#show-org-connect-status][Show org connect status]]
    - [[#deploy-diff-section-between-two-branches][Deploy diff section between two branches]]
    - [[#change-org-connection][Change org connection]]
    - [[#scratchsanbox-org][Scratch/Sanbox org]]
    - [[#sd-news][SD news]]
    - [[#package-name-1][Package name]]
  - [[#apex-features][Apex features]]
    - [[#apex-logs][Apex logs]]
    - [[#apex-log][Apex log]]
      - [[#get-log][Get Log]]
      - [[#get-filter-log][Get filter log]]
    - [[#apex-log-tail][Apex log tail]]
    - [[#execute-apex-code-1][Execute apex code]]
    - [[#metadata-features][Metadata features]]
      - [[#visualforce-page][visualforce page]]
      - [[#visualforce-component][Visualforce Component]]
      - [[#apex-trigger][Apex trigger]]
      - [[#apex-class][Apex class]]
        - [[#test-class][Test class]]
        - [[#method-test][Method test]]
      - [[#lightning-metadata][Lightning Metadata]]
        - [[#lwc][LWC]]
        - [[#aura][AURA]]
        - [[#lightning-app][LIGHTNING APP]]
        - [[#event][EVENT]]
        - [[#interface][INTERFACE]]
        - [[#component-test][component test]]
    - [[#package-name-2][Package name]]
  - [[#soql-features][SOQL features]]
    - [[#soql-key-map-list-view-buffer][SOQL key map list view buffer]]
    - [[#execute-soql-string][execute soql string]]
      - [[#soql-file][SOQL file]]
    - [[#execution-apex-unit-test][Execution apex unit test]]
      - [[#execute-tests][Execute tests]]
      - [[#run-tests-class][Run tests class]]
      - [[#run-local-test-classes][Run local test classes]]
      - [[#run-method-test][Run method test]]
    - [[#run-lwc-local-server][RUN LWC LOCAL SERVER]]
    - [[#package-name-3][Package name]]
  - [[#log-features][Log features]]
    - [[#fetch-log-file][Fetch log file]]
    - [[#build-collection-for-completing-read][Build collection for completing read]]
    - [[#fetch-log-list][Fetch log list]]
    - [[#clear-log][Clear log]]
    - [[#package-name-4][Package name]]
  - [[#project-note][Project note]]
  - [[#project][Project]]
    - [[#projectile][Projectile]]
    - [[#project-create][Project create]]
    - [[#push-source][Push source]]
    - [[#retrieve-source][Retrieve source]]
    - [[#backup-source][Backup source]]
    - [[#diff-metadata-with-org][Diff metadata with org]]
      - [[#hooks][Hooks]]
      - [[#ediff-to-current-org][Ediff to current org]]
      - [[#ediff-to-other-org][Ediff to other org]]
      - [[#ediff-3-metadata][Ediff 3 metadata]]
      - [[#track-history-sources][Track history sources]]
    - [[#package-name-5][Package Name]]
  - [[#package-name-6][Package name]]
- [[#ctable-build][CTABLE BUILD]]
  - [[#requirements][Requirements]]
  - [[#build-table][Build table]]
    - [[#popup-ctable-component][Popup ctable component]]
    - [[#build-ctable-component][Build ctable component]]
    - [[#build-ctable-header][Build ctable header]]
    - [[#build-ctable-data][Build ctable data]]
  - [[#package-name-7][Package name]]
- [[#minor-mode][MINOR MODE]]
  - [[#requirements-1][Requirements]]
  - [[#key-map][Key map]]
  - [[#config-mode-line][Config mode line]]
  - [[#define-minor-mode][Define minor mode]]

