dx-core.el

(defun dx-build-sf-command (&rest args)
  `(,dx-lib-alias ,@args))

(defun dx-execute-apex (content)
"emacs make-process pipe Execute code"
  (let ((code (unless content
               (point-min)
               content))
        (temp-file (make-temp-file "temp_code")))

   (write-region (point-min) (point-max) temp-file)
   (setq execute-apex-code-command
     (dx-build-sf-command "apex" "run" "-f" temp-file))

   (async-shell-command execute-apex-code-command buffer)))

(cl-defun dx-execute-soql (&key query (type 'string) options)
  "Excute command fetch records from Salesforce through api"
  (let ((execute-soql-code (dx-build-sf-command dx-data-command-alias
                                                 "query"
                                                 (pcase type
                                                   ('string
                                                    `,@("--query" query))
                                                   ('file
                                                    `,@("--file" query)))
                                                 "--json")))

    (dx-make-process-json
     :cmd execute-soql-code
     (when (length= (dx-get-data-json "result.records" json-instance) 0)
       (alert "No records found"
              :title "Salesforce Query")
       (error "No records found"))

     (let* ((records-list (dx-get-data-json "result.records" json-instance))
            (header-columns (remove-if (lambda (key) (member key '("attributes")))
                                       (hash-table-keys (aref records-list 0))))
            (data (dx-table--make-data-table-from-vector
                   :header-columns header-columns
                   :data records-list)))

       (add-to-list 'header-columns "No")

       (with-current-buffer (pop-to-buffer
                             (dx-table--create-table
                              :model
                              (dx-table--make-table-mode
                               :column-header
                               (cl-loop for key in header-columns
                                        when (not (string= key ""))
                                        collect `(:align ,'left :title ,key `:max-width ,'50))
                               :data data)
                              :buffer dx-dedicated-window-right
                              :open 't))
         (ctbl:table-mode)
         (read-only-mode))))))
