salesforce-minor-mode.org
** Check org status
#+begin_src emacs-lisp
  (defun dx--org-status (&optional org)
    "Check current org status."
    (let ((json-instance (dx-make-process-json-sync
                          :cmd (append (dx-build-sf-command dx-org-command-alias "display" "--json")
                                       (when org (list "-o" org))))))
      (cond ((= (plist-get json-instance :status) 0)
             (dx-get-data-json "result.connectedStatus" json-instance))
            (t (funcall #'dx-handle-process-error--json json-instance)))))
#+end_src
** Get lwc directory
#+begin_src emacs-lisp
  (defun dx--get-lwc-directory ()
    "Get lwc directory."
    (expand-file-name dx-default-lwc-path (dx-find-root-dir)))
#+end_src

** Find parents
#+begin_src emacs-lisp
  (defun dx--find-parents (file &optional depth)
    "Find parents of directory."
    (if (< depth 1)
        (file-name-directory (directory-file-name file))
      (dx--find-parents (file-name-directory (directory-file-name file)) (- depth 1))))
#+end_src
** Package name
#+begin_src emacs-lisp
(provide 'dx-core)
#+end_src
* DX PROCESS
:PROPERTIES:
:header-args+: :tangle dx-process.el
:END:
#+begin_src emacs-lisp
  (require 'dx-config)
  (require 'alert)
  (require 'cl)
  (require 'json)
  (require 'async)
#+end_src
** Process event log
#+begin_src emacs-lisp
  
#+end_src
** Parse json
#+begin_src emacs-lisp
  (defun dx--process-parse-json (content)
    "Parse `content' to json."
    (condition-case json-instance
        (json-parse-string content :object-type 'plist)
      (:sucess json-instance)
      (error (cond ((string-match-p "json-parse-error" (symbol-name (car json-instance)))
                    (alert "something wrong with JSON result."
                           :title "DX Alert"
                           :severity 'urgent))
                   (t (alert (message json-instance)
                             :title "DX Alert"
                             :severity 'urgent))))))
#+end_src


** Make Process
#+begin_src emacs-lisp
  (defun dx-make-handle-error-process (&optional buffer)
    "Handle errors for process."
    (let ((output-buffer (or buffer (generate-new-buffer dx-process-error-buffer))))
      (make-pipe-process
       :name dx-process-error-buffer
       :buffer output-buffer
       :noquery nil
       :sentinel
       (lambda (process event) 
         (with-current-buffer output-buffer
           (beginning-of-buffer)

           (condition-case json-instance
               (json-parse-buffer)
             (error (cond ((= (buffer-size) 0)
                           nil)
                          (t
                           (alert (replace-regexp-in-string "" "" (buffer-string))
                                  :title "Salesforce Alert"
                                  :severity 'urgent))))))))))

  (cl-defun dx-make-process (&key cmd type callback)
    "Use to make process for all dx command on dx cli.

       `cmd': command want to run use list type.
       `type': type of process, accept value is async or sync.
       OPTION `body': function call after process complete, use for async type and use process result as parameter."
    (unless (member type '(async sync))
      (error "Invalid type of process"))

    (with-environment-variables (("NODE_NO_WARNINGS" "1"))
      (let* ((output-result-buffer (generate-new-buffer dx-process-success-buffer))
             (output-error-buffer (generate-new-buffer dx-process-error-buffer))
             (dx-process
              (make-process
               :name "dx"
               :command cmd
               :buffer (get-buffer-create dx-process-buffer)
               :filter
               (lambda (process output)
                 (with-current-buffer output-result-buffer
                   (insert output)))
               :stderr (dx-make-handle-error-process output-error-buffer))))

        (pcase type
          ('async
           (set-process-sentinel dx-process
                                 (lambda (process event)
                                   (message "Execute %s success" (string-join cmd " "))

                                   (funcall callback
                                            (dx-process-get-content output-result-buffer))

                                   (dx-process-reset (list output-result-buffer output-error-buffer)))))
          ('sync
           (when (accept-process-output dx-process))
           (message "Execute %s success" (string-join cmd " "))

           (prog1 (dx-process-get-content output-result-buffer)
             (dx-process-reset (list output-result-buffer output-error-buffer))))))))

  (defmacro dx-process-get-content (buffer)
    "Get content of process."
    `(with-current-buffer (get-buffer ,buffer)
       (buffer-string)))
#+end_src
** Make chain process
#+begin_src emacs-lisp
  (defun dx--execute-asynchronous-process (process-list &optional params)
    "Execute asynchronous action."
    (async-let ((proc (pop process-list)))
      (async-start (lambda ()
                     (cond ((fboundp proc)
                            (funcall proc))
                           (t
                            (funcall-interactively proc))))
                   (lambda (result)
                     (message "%s" result)))))

  (defun dx-make-chain-process (&rest process-list &key params &allow-other-keys)
    "Chain all processes."
    (let ((proc (pop process-list)))
      (dx-make-process
       :cmd (plist-get proc :cmd)
       :type 'async
       :callback (lambda (content)
                   (let ((result-proc (condition-case error
                                          (funcall (plist-get proc :callback) content params)
                                        (error (alert (format "%s" error)
                                                      :title "DX Alert"
                                                      :severity 'urgent)))))
                     (dx-make-chain-process (car process-list) :params result-proc))))))
#+end_src
** Handler Json output
#+begin_src emacs-lisp
  (cl-defmacro dx-make-process-json-async (&rest body &key cmd &allow-other-keys)
    "Execute async dx cli command and return json result."
    `(let ((cb (lambda (content)
                 (let ((json-instance (json-parse-string content :object-type 'plist)))
                   ,@body))))
       (condition-case json-instance
           (dx-make-process :cmd ,cmd
                            :type 'async 
                            :callback cb)
         (error (cond ((string-match-p "json-parse-error" (symbol-name (car json-instance)))
                       (alert "something wrong with JSON result."
                              :title "DX Alert"
                              :severity 'urgent))
                      (t (alert (message json-instance)
                                :title "DX Alert"
                                :severity 'urgent)))))))

  (cl-defmacro dx-make-process-json-sync (&key cmd)
    "Execute sync dx cli command and return json result."
    `(condition-case json-instance
         (json-parse-string (dx-make-process :cmd ,cmd :type 'sync) :object-type 'plist)
       (:success json-instance)
       (error (cond ((string-match-p "json-parse-error" (symbol-name (car json-instance)))
                     (alert "something wrong with JSON result."
                            :title "DX Alert"
                            :severity 'urgent))
                    (t (alert json-instance
                              :title "DX Alert"
                              :severity 'urgent))))))
#+end_src
** Clear process buffers
#+begin_src emacs-lisp
  (defun dx-process-reset (buffers)
    (mapc (lambda (buffer)
            (when buffer
              (with-current-buffer buffer
                (let ((set-buffer-modified-p nil))
                  (ignore-errors
                    (kill-process)
                    (kill-this-buffer))))))
          buffers))
#+end_src 
** Provide Name
#+begin_src emacs-lisp
  (provide 'dx-process)
#+end_src
* DX FEATURES
:PROPERTIES:
:header-args+: :tangle dx-feature.el
:END:
** Org features
:PROPERTIES:
:header-args+: :tangle dx-org.el
:END:
#+begin_src emacs-lisp
(require 'dx-core)
#+end_src
