dx-core.el

(defun dx--org-status (&optional org)
  "Check current org status."
  (let ((json-instance (dx-make-process-json-sync
                        :cmd (append (dx-build-sf-command dx-org-command-alias "display" "--json")
                                     (when org (list "-o" org))))))
    (cond ((= (plist-get json-instance :status) 0)
           (dx-get-data-json "result.connectedStatus" json-instance))
          (t (funcall #'dx-handle-process-error--json json-instance)))))

(defun dx--get-lwc-directory ()
  "Get lwc directory."
  (expand-file-name dx-default-lwc-path (dx-find-root-dir)))

(defun dx--find-parents (file &optional depth)
  "Find parents of directory."
  (if (< depth 1)
      (file-name-directory (directory-file-name file))
    (dx--find-parents (file-name-directory (directory-file-name file)) (- depth 1))))

(provide 'dx-core)
