dx-apex.el
(defun dx-apex-get-all-log ()
  "Get log apex"
  (interactive)

  (dx-make-process-json-async
   :cmd (dx-build-sf-command dx-apex-command-alias "list" "log" "--json")
   (let* ((records-list (dx-get-data-json "result" json-instance))
          (header-columns '("No" "Id" "Browser" "Operation"))
          (data (dx-table--make-data-table-from-vector
                 :header-columns header-columns
                 :data records-list)))

     (pop-to-buffer
      (dx-table--create-table
       :model
       (dx-table--make-table-mode
        :column-header
        (cl-loop for key in header-columns
                 collect `(:align ,'left :title ,key `:max-width ,'50))
        :data data)
       :buffer dx-dedicated-window-right
       :open t)))))
