salesforce-minor-mode.org
***** component test
#+begin_src emacs-lisp
(defun dx-lightning-test-generate ()
  "Create lightning test"
  (interactive)
  (dx-lightning-generate
   :type "test"
   :output-dir (dx-build-full-path dx-default-test-path)
   :message-success "Create test %s sucess"))
#+end_src
*** Package name
#+begin_src emacs-lisp
(provide 'dx-apex)
#+end_src
** SOQL features
:PROPERTIES:
:header-args+: :tangle dx-query.el
:END:
#+begin_src emacs-lisp
  (require 'dx-core)
  (require 'soql-ts-mode)
  (require 'treesit)
#+end_src
*** SOQL key map list view buffer
*** execute soql string
- <2023-12-23 Sat> : code can read history, then pass to read-minibuffer, but need check history file exist and update history back to file.
#+begin_src emacs-lisp
  (defun dx-soql-string ()
    "Fetch salesforce record by calling API through Salesforce CLI library"
    (interactive)
    (let* ((cache-dir (dx--get-cache-folder-path))
           ;; config local hook for minibuffer
           (minibuffer-history (cl-remove-if (lambda (item)
                                               (not (null (s-index-of item "SELECT"))))
                                             minibuffer-history))
           (minibuffer-mode-hook '(soql-ts-mode))
           (max-mini-window-height 5))

      (dx-execute-soql :query (completing-read "SOQL: " minibuffer-history nil 'require-match))))
#+end_src
**** TODO SOQL file
#+begin_src emacs-lisp
  (defun dx-fetch-record-through-file ()
    "Fetch record through file."
    (interactive)
    (dx-execute-soql :file (read-file-name "SOQL File: ")))
#+end_src
*** Execution apex unit test
#+begin_src emacs-lisp
  (cl-defmacro dx-apex-get-result-test-job (&rest body &key job-id &allow-other-keys)
    "Get result tests"
    `(dx-make-process-json-async
      :cmd (dx-build-sf-command dx-apex-command-alias "get" "test" "-i" ,job-id "--code-coverage" "--json")
      ,@body))
#+end_src
**** Execute tests
#+begin_src emacs-lisp
  (defmacro dx-tests-execute (&rest test-cases)
    `(dx-make-process-json-async
      :cmd (dx-build-sf-command dx-apex-command-alias
                                "run"
                                "test"
                                ,@test-cases
                                "--test-level"
                                "RunSpecifiedTests"
                                "--detailed-coverage"
                                "--code-coverage"
                                "--json")
      (let* ((poll-id nil)
             (job-id (dx-get-data-json "result.testRunId" json-instance))
             (callback (lambda (job-id)
                         (dx-apex-get-result-test-job
                          :job-id job-id
                          (cond ((= (plist-get json-instance :status) 100)
                                 (alert (dx-get-data-json "result.tests.0.StackTrace" json-instance)
                                        :title "DX Alert"
                                        :severity 'urgent))
                                (t (alert (format "Tests class run success with coverage %s"
                                                  (dx-get-data-json "result.summary.testRunCoverage" json-instance))
                                          :title "DX Alert")))
                          (cancel-timer poll-id)))))
        (cond ((and (= (plist-get json-instance :status) 0)
                  job-id)
               (alert (format "%s class is running." `,(file-name-base))
                      :title "DX Alert")
               (setq poll-id (run-at-time 60 t callback job-id)))
              ((= (plist-get json-instance :status) 0)
               (alert (format "Tests class run success with coverage %s"
                              (dx-get-data-json "result.summary.testRunCoverage" json-instance))
                      :title "DX Alert"))
              (t (funcall #'dx-handle-process-error--json json-instance))))))
#+end_src

**** Run tests class
#+begin_src emacs-lisp
  (defun dx-apex-run-test-class ()
    "Run unit test for class"
    (interactive)
    (dx-tests-execute "--tests" (file-name-base)))
#+end_src
**** Run local test classes
#+begin_src emacs-lisp
  (defun dx-apex-run-local-tests ()
    "Run all tests class expect tests class in org managed package"
    (interactive)
    (dx-make-process-json-async
     :cmd (dx-generate-command (list dx-apex-command-alias "run" "test" "--test-level" "RunLocalTests" "--json"))
     (dx-apex-get-result-test-job (job-id (dx-get-data-json "result.testRunId" json-instance)))))
#+end_src
**** Run method test
#+begin_src emacs-lisp
  (defun dx-apex-run-method-test (node)
    "Execute method test."
    (interactive
     (list (treesit-parent-until (treesit-node-at (point))
                              (lambda (node)
                                (string= (treesit-node-type node) "method_declaration")))))
    (when-let ((func-name (treesit-node-text (treesit-node-child-by-field-name node "name"))))
      (dx-tests-execute "--tests" (format "%s.%s" (file-name-base) func-name))))
#+end_src
*** RUN LWC LOCAL SERVER
#+begin_src emacs-lisp
  (defun dx-server-local-lwc ()
    "Start lwc server on local."
    (interactive)
    (dx-make-async-process
     :cmd (dx-generate-command (list dx-legacy-alias "lightning" "lwc" "start" "--json"))
     (alert "Start lwc local server success"
            :title "Salesforce Alert")))
#+end_src

*** Package name
#+begin_src emacs-lisp
  (provide 'dx-query)
#+end_src

** Log features
:PROPERTIES:
:header-args+: :tangle dx-log.el
:END:
#+begin_src emacs-lisp
  (require 'dx-config)
  (require 'dx-core)
#+end_src
*** Fetch log file
#+begin_src emacs-lisp
  (defun dx-log-get-log ()
    "Fetch log."
    (interactive)
    (dx--log-fetch-logs
     (let ((log-list-map (make-hash-table :test #'equal)))
       (dolist (data log-list)
         (puthash  (dx-get-data-json "Id" data) data log-list-map))

       (dx-make-process-json-async
        :cmd
        (dx-build-sf-command dx-apex-command-alias
                             "get"
                             "log"
                             "--log-id"
                             (consult--read (hash-table-keys log-list-map)
                                            :prompt "Log: "
                                            :require-match t
                                            :annotate (lambda (item)
                                                        (let* ((data (gethash item log-list-map))
                                                               (size (/ (dx-get-data-json "LogLength" data) (* 1024 1024)))
                                                               (op (dx-get-data-json "Operation" data))
                                                               (time (format-time-string "%Y-%m-%d" (parse-time-string (dx-get-data-json "StartTime" data)))))

                                                          (list (propertize item 'face '(:width 10 :foreground "yellow")) nil (format "%s:%s" size time)))))
                             "--json")
        (cond ((= (plist-get json-instance :status) 0)
               (with-current-buffer (find-file-noselect (format "%s.log" (concat (dx--get-log-dir-path) log-id)))
                 (erase-buffer)
                 (insert (dx-get-data-json "result.0.log" json-instance))
                 (save-buffer))
               (alert (format "Fetch log %s success" log-id)
                      :title "DX Alert"))
              (t (funcall #'dx-handle-process-error--json json-instance)))))))
#+end_src
