dx-apex.el

(defun dx-lightning-test-generate ()
  "Create lightning test"
  (interactive)
  (dx-lightning-generate
   :type "test"
   :output-dir (dx-build-full-path dx-default-test-path)
   :message-success "Create test %s sucess"))

(provide 'dx-apex)
