dx-log.el

(defun dx-log-get-log ()
  "Fetch log."
  (interactive)
  (dx--log-fetch-logs
   (let ((log-list-map (make-hash-table :test #'equal)))
     (dolist (data log-list)
       (puthash  (dx-get-data-json "Id" data) data log-list-map))

     (dx-make-process-json-async
      :cmd
      (dx-build-sf-command dx-apex-command-alias
                           "get"
                           "log"
                           "--log-id"
                           (consult--read (hash-table-keys log-list-map)
                                          :prompt "Log: "
                                          :require-match t
                                          :annotate (lambda (item)
                                                      (let* ((data (gethash item log-list-map))
                                                             (size (/ (dx-get-data-json "LogLength" data) (* 1024 1024)))
                                                             (op (dx-get-data-json "Operation" data))
                                                             (time (format-time-string "%Y-%m-%d" (parse-time-string (dx-get-data-json "StartTime" data)))))

                                                        (list (propertize item 'face '(:width 10 :foreground "yellow")) nil (format "%s:%s" size time)))))
                           "--json")
      (cond ((= (plist-get json-instance :status) 0)
             (with-current-buffer (find-file-noselect (format "%s.log" (concat (dx--get-log-dir-path) log-id)))
               (erase-buffer)
               (insert (dx-get-data-json "result.0.log" json-instance))
               (save-buffer))
             (alert (format "Fetch log %s success" log-id)
                    :title "DX Alert"))
            (t (funcall #'dx-handle-process-error--json json-instance)))))))
