salesforce-minor-mode.org
*** Build collection for completing read
#+begin_src emacs-lisp
  (defun dx--convert-log-to-obarray (log-list attrs)
    "Generate obarray from plist."
    (let ((array (obarray-make (* (length log-list) (length attrs)))))

      (dolist (log-data log-list)
        (dolist (attr attrs)
          (obarray-put array (plist-get log-data attr))))))
  

#+end_src
#+begin_src emacs-lisp :tangle no
  (dx--log-fetch-logs
   (let ((log-list-map (make-hash-table)))
     (dolist (data log-list)
       (puthash "test" data log-list-map))

     (dx-make-process-json-async
      :cmd
      (dx-build-sf-command dx-apex-command-alias
                           "get"
                           "log"
                           "--log-id"
                           (consult--read (hash-table-keys log-list-map)
                                          :prompt "Log: "
                                          :require-match t
                                          :annotate (lambda (item)
                                                      (message "%s %s %s" item log-list-map (gethash (format "%s" item) log-list-map))
                                                      (let* ((data (gethash item log-list-map))
                                                             (size (/ (dx-get-data-json "LogLength" data) (* 1024 1024)))
                                                             (op (dx-get-data-json "Operation" data))
                                                             (time (format-time-string "%Y-%m-%d" (parse-time-string (dx-get-data-json "StartTime" data)))))

                                                        (list item op (format "%s:%s" size time)))))
                           "--json")
      (cond ((= (plist-get json-instance :status) 0)
             (with-current-buffer (find-file-noselect (format "%s.log" (concat (dx--get-log-dir-path) log-id)))
               (erase-buffer)
               (insert (dx-get-data-json "result.0.log" json-instance))
               (save-buffer))
             (alert (format "Fetch log %s success" log-id)
                    :title "DX Alert"))
            (t (funcall #'dx-handle-process-error--json json-instance))))))
#+end_src

*** Fetch log list
#+begin_src emacs-lisp
  (defmacro dx--log-fetch-logs (&rest body)
    "Fetch all logs list."
    `(dx-make-process-json-async
      :cmd
      (dx-build-sf-command dx-apex-command-alias "log" "list" "--json")
      (cond ((= (plist-get json-instance :status) 0)
             (let* ((log-list (dx-get-data-json "result" json-instance)))

               ,@body))
            (t (funcall #'dx-handle-process-error--json json-instance)))))
#+end_src

*** Clear log
#+begin_src emacs-lisp
  (defun dx-clear-log ()
    "Clear all apex log on org."
    (interactive)

    (dx-org-alias-list
     (let ((temp-file (make-temp-file "log" nil ".csv"))
           (org-name (completing-read "Org name: " org-list nil 'require-match dx-org-name)))

       (dx-make-chain-process
        (list :cmd (dx-build-sf-command
                 dx-data-command-alias "query" "--query" "SELECT Id FROM ApexLog" "-t" "-r" "csv" "-o" org-name)
           :callback
           (lambda (&rest arg)
             ;; Save data to temp file.
             (with-current-buffer dx-process-success-buffer
               (write-region (point-min) (point-max) temp-file))))

        ;; Clear log on org.
        (list :cmd
           (dx-build-sf-command
            dx-data-command-alias "delete" "bulk" "--sobject" "ApexLog" "--file" temp-file "--json")
           :callback
           (alert "Clear log success"
                  :title "DX Alert"))))))
#+end_src

*** Package name
#+begin_src emacs-lisp
  (provide 'dx-log)
#+end_src

** Project note
#+begin_src emacs-lisp
(defun dx-open-project-note ()
  "Open note for current project."
  (interactive)
  (if-let ((note-file (plist-get (cl-find-if (lambda (el)
                                               (string= (expand-file-name (plist-get el :project)) dx-project-root-dir))
                                             dx-project-config)
                                 :note-file)))

      (display-buffer-in-side-window (find-file-noselect
                                      (expand-file-name note-file))
                                     '((side . right)
                                       (window-width . 0.4)))
    (error "note file not found.")))
#+end_src
** Project
:PROPERTIES:
:header-args+: :tangle dx-project.el
:END:
#+begin_src emacs-lisp
  ;;; Code
  (require 'projectile)
  (require 'dx-config)
  (require 'dx-process)
  (require 'dx-core)
#+end_src
*** Projectile
#+begin_src emacs-lisp
  (defcustom dx-files-test-root '(".forceignore")
    "The list of files to determine a project is Salesforce project."
    :type 'list
    :group 'salesforce-project)

  (defcustom dx-project-configuration '((nil . ((eval . (dx-minor-mode 1)))))
    "The list of configuration for Salesforce project."
    :type 'list
    :type 'salesforce-project)

  (defun dx-project-p (&optional dir)
    "Check root is Salesforce project."
    (let ((default-directory (or dir (projectile-project-root)))
          (project-pass nil))

      (dolist (file dx-files-test-root)
        (setq project-pass (or project-pass (projectile-verify-file-wildcard file))))
      project-pass))

  ;; (defun salesforce-initialize-configuration-projectes (projects)
  ;;   "Initialize configuration for list of projects."
  ;;   (dotimes (project projects)))

  ;;;###autoload
  (defun dx-project-init ()
    "Initialize configuarion for Salesforce project."
    (when (eq (projectile-project-type) 'dx)
      (dir-locals-set-class-variables 'project-configuration dx-project-configuration)
      (dir-locals-set-directory-class (projectile-project-root) 'project-configuration)))

  ;; Define own projectile
  (projectile-register-project-type 'dx #'dx-project-p
                                    :project-file "package.json"
                                    :compile "npm install")

  ;; Add initialize salesforce for projectile
  (eval-after-load 'projectile
    (add-hook 'projectile-after-switch-project-hook #'dx-project-init))

  #+end_src
*** Project create
- [X] Auto add project to projectile  
#+begin_src emacs-lisp
  (defun dx-project-create ()
    "Create dx project"
    (interactive)
    (let* ((project-path (read-directory-name "project path: "))
           (package-dir (read-string "package dir: ")))

      (make-directory project-path 'parents)

      (dx-make-process-json-async
       :cmd (dx-build-sf-command
             dx-project-command-alias
             "generate"
             "--name" project-path
             "--default-package-dir" package-dir
             "--json")
       (let ((project-output (dx-get-data-json "result.outputDir" json-instance)))

         (alert "Create Project Success"
                :title "DX Alert")))))
#+end_src
