dx-log.el

(defun dx--convert-log-to-obarray (log-list attrs)
  "Generate obarray from plist."
  (let ((array (obarray-make (* (length log-list) (length attrs)))))

    (dolist (log-data log-list)
      (dolist (attr attrs)
        (obarray-put array (plist-get log-data attr))))))

(defmacro dx--log-fetch-logs (&rest body)
  "Fetch all logs list."
  `(dx-make-process-json-async
    :cmd
    (dx-build-sf-command dx-apex-command-alias "log" "list" "--json")
    (cond ((= (plist-get json-instance :status) 0)
           (let* ((log-list (dx-get-data-json "result" json-instance)))

             ,@body))
          (t (funcall #'dx-handle-process-error--json json-instance)))))

(defun dx-clear-log ()
  "Clear all apex log on org."
  (interactive)

  (dx-org-alias-list
   (let ((temp-file (make-temp-file "log" nil ".csv"))
         (org-name (completing-read "Org name: " org-list nil 'require-match dx-org-name)))

     (dx-make-chain-process
      (list :cmd (dx-build-sf-command
               dx-data-command-alias "query" "--query" "SELECT Id FROM ApexLog" "-t" "-r" "csv" "-o" org-name)
         :callback
         (lambda (&rest arg)
           ;; Save data to temp file.
           (with-current-buffer dx-process-success-buffer
             (write-region (point-min) (point-max) temp-file))))

      ;; Clear log on org.
      (list :cmd
         (dx-build-sf-command
          dx-data-command-alias "delete" "bulk" "--sobject" "ApexLog" "--file" temp-file "--json")
         :callback
         (alert "Clear log success"
                :title "DX Alert"))))))

(provide 'dx-log)
