dx-project.el

(defcustom dx-files-test-root '(".forceignore")
  "The list of files to determine a project is Salesforce project."
  :type 'list
  :group 'salesforce-project)

(defcustom dx-project-configuration '((nil . ((eval . (dx-minor-mode 1)))))
  "The list of configuration for Salesforce project."
  :type 'list
  :type 'salesforce-project)

(defun dx-project-p (&optional dir)
  "Check root is Salesforce project."
  (let ((default-directory (or dir (projectile-project-root)))
        (project-pass nil))

    (dolist (file dx-files-test-root)
      (setq project-pass (or project-pass (projectile-verify-file-wildcard file))))
    project-pass))

;;;###autoload
(defun dx-project-init ()
  "Initialize configuarion for Salesforce project."
  (when (eq (projectile-project-type) 'dx)
    (dir-locals-set-class-variables 'project-configuration dx-project-configuration)
    (dir-locals-set-directory-class (projectile-project-root) 'project-configuration)))

;; Define own projectile
(projectile-register-project-type 'dx #'dx-project-p
                                  :project-file "package.json"
                                  :compile "npm install")

;; Add initialize salesforce for projectile
;; (eval-after-load 'projectile
;;   (add-hook 'projectile-after-switch-hook #'dx-project-init))

(defun dx-project-create ()
  "Create dx project"
  (interactive)
  (let* ((project-path (read-directory-name "project path: "))
         (package-dir (read-string "package dir: ")))

    (make-directory project-path 'parents)

    (dx-make-process-json-async
     :cmd (dx-build-sf-command
           dx-project-command-alias
           "generate"
           "--name" project-path
           "--default-package-dir" package-dir
           "--json")
     (let ((project-output (dx-get-data-json "result.outputDir" json-instance)))

       (alert "Create Project Success"
              :title "DX Alert")))))
