salesforce-minor-mode.org
*** Push source
#+begin_src emacs-lisp
  (defun dx-source-push (buffer)
    "Push file to salesforce org."
    (interactive (list (buffer-file-name)))

    (if (file-in-directory-p buffer (dx-build-full-path dx-default-apex-class-path))
        (dx-source-backup
         (dx-make-process-json-async
          :cmd (dx-build-sf-command "force" "source" "deploy" "-p" buffer "--json")
          (cond ((and (plist-member json-instance :code)
                    (= (plist-get json-instance :code) 1)
                    (string= (plist-get json-instance :name) "RefreshTokenAuthError"))
                 (alert (plist-get json-instance :message)
                        :title "DX Alert"))
                ((= (plist-get json-instance :status) 0)
                 (alert (format "Deploy %s success" buffer)
                        :title "DX Alert"))
                (t (funcall #'dx-handle-process-error--json json-instance)))))

      (dx-make-process-json-async
       :cmd (dx-build-sf-command "force" "source" "deploy" "-p" buffer "--json")
       (cond ((and (plist-member json-instance :code)
                 (= (plist-get json-instance :code) 1)
                 (string= (plist-get json-instance :name) "RefreshTokenAuthError"))
              (alert (plist-get json-instance :message)
                     :title "DX Alert"))
             ((= (plist-get json-instance :status) 0)
              (alert (format "Deploy %s success" buffer)
                     :title "DX Alert"))
             (t (funcall #'dx-handle-process-error--json json-instance))))))

  (defun dx-source-backup-sync ()
    "Backup the current buffer to the source directory."
    (let* ((buffer (buffer-file-name))
           (file-name (file-name-base buffer))
           (cache-dir (dx--get-cache-folder-path))
           (backup-file-name (concat file-name "_" (format "%s" (time-convert (current-time) 'integer))))
           (json-instance))

      (unless (file-exists-p cache-dir)
        (make-directory cache-dir 'parents))

      (setq json-instance (dx-make-process-json-sync
                           :cmd (append (dx-build-sf-command dx-project-command-alias
                                                             "retrieve"
                                                             "start"
                                                             "-d" buffer
                                                             "-z"
                                                             "-t" cache-dir
                                                             "--zip-file-name" backup-file-name
                                                             "--json"))))
      (unless json-instance
        (error (concat "Backup " file-name " Failure")))
      ;; rename backup directory to new directory containing the last modified id
      ;; and the last modified date

      (when-let ((new-dir-name (concat cache-dir "/" backup-file-name "_"
                                       (dx-get-data-json "result.fileProperties.0.lastModifiedById"
                                                         json-instance)
                                       "_"
                                       (format "%s"
                                               (time-convert
                                                (date-to-time
                                                 (dx-get-data-json "result.fileProperties.0.lastModifiedDate"
                                                                   json-instance))
                                                'integer)))))
        (rename-file (concat cache-dir "/" backup-file-name)
                     new-dir-name))))

  (defun dx-source-push-chain-test-1 ()
    "Test 1"
    (dx--execute-asynchronous-process (list #'dx-source-backup-sync #'dx-source-retrieve)))

  (defun dx-source-push-chain-test (buffer)
    "Push file to Salesforce org."
    (interactive (list (buffer-file-name)))
    (let* ((file-name (file-name-base buffer))
           (cache-dir (dx--get-cache-folder-path))
           (backup-file-name (concat file-name "_" (format "%s" (time-convert (current-time) 'integer)))))

      (dx-make-chain-process
       (list :cmd (dx-build-sf-command dx-project-command-alias
                                       "retrieve"
                                       "start"
                                       "-d" buffer
                                       "-z"
                                       "-t" cache-dir
                                       "--zip-file-name" backup-file-name
                                       "--json")
             :callback (lambda (content params)
                         (let ((json-instance (dx--process-parse-json content)))

                           (unless json-instance
                             (error (concat "Backup " file-name " Failure")))
                           ;; rename backup directory to new directory containing the last modified id
                           ;; and the last modified date

                           (when-let ((new-dir-name (concat cache-dir "/" backup-file-name "_"
                                                            (dx-get-data-json "result.fileProperties.0.lastModifiedById"
                                                                              json-instance)
                                                            "_"
                                                            (format "%s"
                                                                    (time-convert
                                                                     (date-to-time
                                                                      (dx-get-data-json "result.fileProperties.0.lastModifiedDate"
                                                                                        json-instance))
                                                                     'integer)))))
                             (rename-file (concat cache-dir "/" backup-file-name)
                                          new-dir-name)))))
       ;; Push source 
       (list :cmd (dx-build-sf-command "force"
                                       "source"
                                       "deploy"
                                       "-p"
                                       buffer
                                       "--json")
             :callback (lambda (content params)
                         (let ((json-instance (dx--process-parse-json content)))
                           (cond ((and (plist-member json-instance :code)
                                       (= (plist-get json-instance :code) 1)
                                       (string= (plist-get json-instance :name) "RefreshTokenAuthError"))
                                  (alert (plist-get json-instance :message)
                                         :title "DX Alert"))
                                 ((= (plist-get json-instance :status) 0)
                                  (alert (format "Deploy %s success" buffer)
                                         :title "DX Alert"))
                                 (t (funcall #'dx-handle-process-error--json json-instance)))))))))
#+end_src
*** Retrieve source
#+begin_src emacs-lisp
  (defun dx-source-retrieve (buffer)
    "Retrieve source salesforce form org"
    (interactive (list (buffer-file-name)))
    (dx-make-process-json-async
     :cmd (dx-build-sf-command "force" "source" "retrieve" "-p" buffer "--json")
     (cond ((and (plist-member json-instance :code)
               (= (plist-get json-instance :code) 1)
               (string= (plist-get json-instance :name) "RefreshTokenAuthError"))
            (alert (plist-get json-instance :message)
                   :title "DX Alert"))
           ((= (plist-get json-instance :status) 0)
            (alert (format "Retrieve %s success" (dx-get-data-json "result.inboundFiles.0.filePath" json-instance))
                   :title "DX Alert"))
           (t (funcall #'dx-handle-process-error--json json-instance)))))

#+end_src
