salesforce-minor-mode.org
*** Backup source
#+begin_src emacs-lisp
  (cl-defmacro dx-source-backup (&rest body &key target-org &allow-other-keys)
    "Backup the current buffer to the source directory."
    `(let* ((buffer (buffer-file-name))
            (file-name (file-name-base buffer))
            (cache-dir (dx--get-cache-folder-path))
            (backup-file-name (concat file-name "_" (format "%s" (time-convert (current-time) 'integer)))))

       (unless (file-exists-p cache-dir)
         (make-directory cache-dir 'parents))

       (dx-make-process-json-async
        :cmd (append (dx-build-sf-command dx-project-command-alias
                                          "retrieve"
                                          "start"
                                          "-d" buffer
                                          "-z"
                                          "-t" cache-dir
                                          "--zip-file-name" backup-file-name
                                          "--json")
                     (when ,target-org (list "-o" ,target-org)))
        (unless json-instance
          (error (concat "Backup " file-name " Failure")))
        ;; rename backup directory to new directory containing the last modified id
        ;; and the last modified date

        (when-let ((new-dir-name (concat cache-dir "/" backup-file-name "_"
                                         (dx-get-data-json "result.fileProperties.0.lastModifiedById"
                                                           json-instance)
                                         "_"
                                         (format "%s"
                                                 (time-convert
                                                  (date-to-time
                                                   (dx-get-data-json "result.fileProperties.0.lastModifiedDate"
                                                                     json-instance))
                                                  'integer)))))
          (rename-file (concat cache-dir "/" backup-file-name)
                       new-dir-name)
          ,@body))))
#+end_src

*** Diff metadata with org
**** Hooks
#+begin_src emacs-lisp
  (defun dx-ediff-startup-hook ()
    "Ediff hook on startup."
    (let* ((coding-system (with-current-buffer ediff-buffer-B
                            buffer-file-coding-system)))

      ;; Set coding for buffer A
      (with-current-buffer ediff-buffer-A
        (set-buffer-file-coding-system coding-system t t))
      (ediff-toggle-read-only ediff-buffer-A)

      (when ediff-buffer-C
        ;; Set coding for buffer C
        (with-current-buffer ediff-buffer-C
          (set-buffer-file-coding-system coding-system t t))

        (ediff-toggle-read-only ediff-buffer-C))

      (ediff-update-diffs)))

  (defun dx-ediff-quit-hook ()
    "Hook on quit."
    (with-current-buffer ediff-buffer-A
      (kill-buffer-and-window))
    (when ediff-buffer-C
      (with-current-buffer ediff-buffer-C
        (kill-buffer-and-window)))

    ;; Clear hooks
    (remove-hook 'ediff-startup-hook #'dx-ediff-startup-hook)
    (remove-hook 'ediff-quit-hook #'dx-ediff-quit-hook))
#+end_src
**** Ediff to current org
#+begin_src emacs-lisp
  (defun dx-diff-metadata ()
    "diff metadata between local and cloud."
    (interactive)
    (let ((full-file-name (buffer-file-name)))

      (dx-source-backup
       (condition-case error
           (ediff (dx--find-backup-file (file-name-nondirectory full-file-name)
                                        new-dir-name)
                  full-file-name
                  `((lambda ()
                      (add-hook 'ediff-quit-hook #'dx-ediff-quit-hook)
                      (add-hook 'ediff-startup-hook #'dx-ediff-startup-hook))))
         (error
          (alert (format "%s" error)
                 :title "DX Alert"
                 :severity 'urgent))))))
#+end_src
**** Ediff to other org
#+begin_src emacs-lisp
  (defun dx-diff-metadata-other-org ()
    "diff metadata between local and cloud."
    (interactive)
    (dx-org-alias-list
     (let* ((full-file-name (buffer-file-name))
            (org (completing-read "Target Org: " org-list nil 'require-match))
            (org-status (dx--org-status org)))

       (unless (string= org-status "Connected"))
       ;;(dx-authen))

       (dx-source-backup
        :target-org org
        (condition-case error
            (ediff (dx--find-backup-file (file-name-nondirectory full-file-name)
                                         new-dir-name)
                   full-file-name
                   '((lambda ()
                       (add-hook 'ediff-startup-hook #'dx-ediff-startup-hook)
                       (add-hook 'ediff-quit-hook #'dx-ediff-quit-hook))))
          (error
           (alert (format "%s" error)
                  :title "DX Alert"
                  :severity 'urgent)))))))
#+end_src

**** TODO Ediff 3 metadata
#+begin_src emacs-lisp
  (defun dx-diff3-metadata ()
    "diff metadata between three enviroments."
    (interactive)
    (let* ((minibuffer-history (dx-org-alias-list))
           (file-name (buffer-file-name))
           (target-org (read-from-minibuffer "Target Org: "))
           (bk-file-org (dx-source-backup))
           (bk-file-target-org (dx-source-backup
                                :target-org target-org)))

      (condition-case error
          (ediff3 (car (directory-files-recursively (concat bk-file-org "/") (file-name-nondirectory file-name))) file-name (car (directory-files-recursively (concat bk-file-target-org "/") (file-name-nondirectory file-name)))
                  '((lambda ())
                    (add-hook 'ediff-startup-hook #'dx-ediff-startup-hook)
                    (add-hook 'ediff-quit-hook #'dx-ediff-quit-hook)))
        (error
         (alert error
                :title "DX Alert"
                :severity 'urgent)))))
#+end_src
