salesforce-minor-mode.org
**** Track history sources
#+begin_src emacs-lisp
  (defun dx-source-tracker ()
    (interactive)
    (let* ((folder-name (file-name-base buffer-file-name))
           (file-name (file-name-nondirectory buffer-file-name))
           (dx-dedicated-window-right "*Org Tracker*")
           (source-list (dx--find-backup-files (format "%s$" file-name)))
           (model
            (dx-table--make-table-mode
             :column-header
             `((:title "Backup DateTime")
               (:title "User Modified Id")
               (:title "Last Modified"))
             :data
             (cl-remove-if 'nil
                           (mapcar (lambda (file)
                                     ;; format files show on buffer
                                     (when-let* ((source-dir (file-name-base (dx--find-parents file 3)))
                                                 (data (string-split source-dir "_"))
                                                 (date-time (format-time-string "%Y/%m/%d %H:%M:%S" (string-to-number (nth 0 data))))
                                                 (user-id (nth 1 data))
                                                 (last-modified-date (format-time-string "%Y/%m/%d %H:%M:%S" (string-to-number (nth 2 data)))))

                                       `(,date-time ,user-id ,last-modified-date ,(concat (nth 3 data) "_" (nth 0 data) "_" user-id "_" (nth 2 data)))))
                                   ;; list of file names
                                   source-list))))
           (component
            (dx-table--create-table
             :model model
             :buffer dx-dedicated-window-right)))

      (ctbl:cp-add-click-hook component
                              `(lambda ()
                                 (when-let* ((data (ctbl:cp-get-selected-data-row ,component))
                                             (cache-dir (concat (dx--get-cache-folder-path)
                                                                (nth 3 data)))))
                                 (ediff (car (directory-files-recursively cache-dir ,file-name))
                                        ,buffer-file-name
                                        '((lambda ()
                                            (add-hook 'ediff-startup-hook #'dx-ediff-startup-hook)
                                            (add-hook 'ediff-quit-hook #'dx-ediff-quit-hook))))))

      (pop-to-buffer (ctbl:cp-get-buffer component))))
#+end_src

*** Package Name
#+begin_src emacs-lisp
  (provide 'dx-project)
#+end_src
** Package name
#+begin_src emacs-lisp
(provide 'dx-feature)
#+end_src
* CTABLE BUILD
:PROPERTIES:
:header-args+: :tangle dx-ctable.el
:END:
** Requirements
#+begin_src emacs-lisp
(require 'dx-config)
(require 'ctable)
#+end_src
** Build table
*** Popup ctable component
#+begin_src emacs-lisp
(cl-defun dx-table--create-table (&key model buffer open)
  "use ctable to build table data"
  (let ((component (ctbl:create-table-component-buffer
                    :model model
                    :buffer (get-buffer-create buffer))))
    (if open
      (ctbl:cp-get-buffer component)
     component)))
#+end_src
*** Build ctable component
#+begin_src emacs-lisp
(cl-defun dx-table--make-table-mode (&key column-header data)
  "use ctable to build table data"
  (let ((column-model
         (mapcar 'dx-table--make-header-model column-header))
        (async-model
         (ctbl:async-model-wrapper data)))

   (make-ctbl:model
    :column-model column-model :data async-model)))
#+end_src
*** Build ctable header
#+begin_src emacs-lisp
(defun dx-table--make-header-model (header-config)
  "build header ctable"
  (let* ((title
          (plist-get header-config :title))
         (min-width
          (plist-get header-config :min-width))
         (max-width
          (plist-get header-config :max-width))
         (align
          (plist-get header-config :align)))

    (make-ctbl:cmodel
     :title title
     :sorter 'ctbl:sort-number-lessp
     :min-width min-width
     :max-width max-width
     :align align)))
#+end_src

*** Build ctable data
#+begin_src emacs-lisp
(cl-defun dx-table--make-data-table-from-vector
    (&key header-columns data (enable-count-rows t))
  "build data from input hash table and header-columns"
  (let ((data-table ()))
    (cl-loop for item in data
             for col in header-columns
             collect `())
    (dotimes (i (length data))
      (let ((row (append (list (+ i 1))
                         (mapcar `(lambda (key)
                                    (let ((value (gethash key ,(aref data i))))

                                      (if (hash-table-p value)
                                          (gethash "url" value)
                                        (cond ((eq value ':null)
                                               "")
                                              ((eq value ':false)
                                               "False")
                                              ((eq value 't)
                                               "True")
                                              (t
                                               value)))))

                                 header-columns))))
        (add-to-list 'data-table row 1 '(lambda (v1 v2)
                                             nil))))
    data-table))
#+end_src
** Package name
#+begin_src emacs-lisp
(provide 'dx-ctable)
#+end_src
* MINOR MODE
:PROPERTIES:
:header-args+: :tangle dx-minor-mode.el
:END:
** Requirements
Libraries use in package
#+begin_src emacs-lisp
  ;;; Salesforce minor mode -- add sf cli to emacs
  (require 'dx-config)
  (require 'dx-ctable)
  (require 'dx-core)
  (require 'dx-apex)
  (require 'dx-org)
  (require 'dx-feature)
  (require 'dx-project)
  (require 'dx-query)
  (require 'dx-log)
  ;; load core packages
  (require 'apex-ts-mode)
  (require 'soql-ts-mode)
#+end_src
** Key map
Default key map for minor mode
|-------+--------------------------+-------------------------------------------------------------|
| Key   | Function                 | Description                                                 |
|-------+--------------------------+-------------------------------------------------------------|
| M-o s | dx-org-authorize-sandbox | Authorize to org sandbox have host is `test.salesforce.com` |
|       |                          |                                                             |
#+begin_src emacs-lisp
  (defvar dx-mode-map
    (let ((map (make-sparse-keymap)))
      ;; org features
      (keymap-set map "M-o s" (cons "Authorize Org" #'dx-org-authorize))
      (keymap-set map "M-o c" (cons "Switch Org" #'dx-org-change))

      (keymap-set map "M-o r" (cons "Retrieve Metadata" #'dx-source-retrieve))
      (keymap-set map "M-o d" (cons "Deploy Metadata" #'dx-source-push))

      (keymap-set map "M-o o" (cons "Open Org" #'dx-org-default-open))
      (keymap-set map "M-o n" (cons "View All Orgs" #'dx-org-display-all-orgs))
      (keymap-set map "M-o m" (cons "View All Devhubs" #'dx-org-display-all-devhubs))
      (keymap-set map "M-o N" (cons "Notes" #'dx-open-project-note))

      ;; log features
      (keymap-set map "M-o l" (cons "Clear Log" #'dx-clear-log))

      ;; apex features
      (keymap-set map "M-c t" (cons "Create Trigger" #'dx-apex-generate-trigger))
      (keymap-set map "M-c c" (cons "Create Apex Class" #'dx-apex-generate-class))
      (keymap-set map "M-c T" (cons "Create Apex Class Test" #'dx-apex-generate-test-class))
      (keymap-set map "M-c F" (cons "Create Method Test" #'dx-apex-generate-test-method))
      ;; project features
      (keymap-set map "M-q t" (cons "Query Record" #'dx-soql-string))
      ;; (keymap-set map "M-q f" (cons "Ex" #'dx-fetch-dx-file))

      ;; visualforce features
      (keymap-set map "M-c v" (cons "Create Visualforce Page" #'dx-visualforce-generate-page))
      (keymap-set map "M-c C" (cons "Create Visualforce Component" #'dx-visualforce-generate-component))

      ;; metadata features
      (keymap-set map "M-m t" (cons "Source Tracker" #'dx-source-tracker))
      (keymap-set map "M-m d" (cons "Diff Source" #'dx-diff-metadata))
      (keymap-set map "M-m D" (cons "Diff Source Multi Org" #'dx-diff3-metadata))
      map)
    "Keymap for `dx-minor-mode'.")
#+end_src

** Config mode line
#+begin_src emacs-lisp
  (defun dx-minor-mode--init ()
    "Initialize mode."
    (setq-default dx-org-name (dx-internal-current-org)
                  dx-project-root-dir (dx-find-root-dir)))
#+end_src
** Define minor mode
#+begin_src emacs-lisp
  ;;;###autoload
  (easy-mmode-define-minor-mode dx-minor-mode
    "Toggles global salesforce minor mode."
    nil ; Inital value, nil for disabled
    :init-value nil
    :group 'dx
    :keymap dx-mode-map

    (when dx-minor-mode
      (dx-minor-mode--init)))

  (provide 'dx-minor-mode) ;;; dx-minor-mode end here.
#+end_src
